#### Terraform Plan ✅
```
module.talos.talos_image_factory_schematic.this: Refreshing state... [id=d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba]
module.talos.talos_machine_secrets.machine_secrets: Refreshing state... [id=machine_secrets]
module.talos.data.talos_image_factory_urls.this: Reading...
module.talos.data.talos_image_factory_urls.this: Read complete after 0s
module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image: Refreshing state... [id=local:iso/talos-v1.11.5-nocloud-amd64.img]
module.talos.data.talos_client_configuration.talosconfig: Reading...
module.talos.data.talos_machine_configuration.machineconfig_worker: Reading...
module.talos.data.talos_machine_configuration.machineconfig_cp: Reading...
module.talos.data.talos_client_configuration.talosconfig: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_worker: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_cp: Read complete after 0s [id=cluster01]
module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"]: Refreshing state... [id=101]
module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"]: Refreshing state... [id=102]
module.talos.talos_machine_configuration_apply.worker_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_configuration_apply.cp_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_bootstrap.bootstrap: Refreshing state... [id=machine_bootstrap]
module.talos.talos_cluster_kubeconfig.kubeconfig: Refreshing state... [id=cluster01]
module.traefik.random_password.ubuntu_container_password: Refreshing state... [id=none]
module.proxmox_csi_plugin.proxmox_virtual_environment_role.csi: Refreshing state... [id=CSI]
module.traefik.proxmox_virtual_environment_download_file.latest_ubuntu_20_focal_lxc_img: Refreshing state... [id=local:vztmpl/ubuntu-20.04-standard_20.04-1_amd64.tar.gz]
module.traefik.tls_private_key.ubuntu_container_key: Refreshing state... [id=0940bdcfb1f2130a3129ccae2ec89db43fb78626]
module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin: Refreshing state... [id=proxmox-csi-plugin]
module.proxmox_csi_plugin.kubernetes_namespace.csi-proxmox: Refreshing state... [id=csi-proxmox]
module.sealed-secrets.helm_release.sealed_secrets: Refreshing state... [id=sealed-secrets-controller]
module.sealed-secrets.kubernetes_namespace.sealed-secrets: Refreshing state... [id=sealed-secrets]
module.monitoring.kubernetes_namespace.monitoring: Refreshing state... [id=monitoring]
module.proxmox_csi_plugin.proxmox_virtual_environment_user.kubernetes-csi: Refreshing state... [id=kubernetes-csi@pve]
module.proxmox_csi_plugin.proxmox_virtual_environment_user_token.kubernetes-csi-token: Refreshing state... [id=kubernetes-csi@pve!csi]
module.sealed-secrets.kubernetes_secret.sealed-secrets-key: Refreshing state... [id=sealed-secrets/sealed-secrets-bootstrap-key]
module.proxmox_csi_plugin.kubernetes_secret.proxmox-csi-plugin: Refreshing state... [id=csi-proxmox/proxmox-csi-plugin]
module.traefik.proxmox_virtual_environment_container.traefik: Refreshing state... [id=108]
module.traefik.null_resource.traefik_config_sync: Refreshing state... [id=5599146275299180159]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image will be destroyed
  # (because resource uses count or for_each)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "gz" -> null
      - file_name               = "talos-v1.11.5-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-v1.11.5-nocloud-amd64.img" -> null
      - node_name               = "pve01" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 4453302272 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba/v1.11.5/nocloud-amd64.raw.gz" -> null
      - verify                  = true -> null
    }

  # module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image["pve01"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "gz"
      + file_name               = "talos-v1.11.5-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "pve01"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba/v1.11.5/nocloud-amd64.raw.gz"
      + verify                  = true
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_cp" {
      ~ boot_order                           = [
          - "virtio0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "101" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "192.168.1.210",
            ],
          - [],
          - [
              - "10.244.1.194",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fd8e:5b31:ecd1:a60b:be24:11ff:fe9c:2bfe",
              - "fe80::be24:11ff:fe9c:2bfe",
            ],
          - [
              - "fe80::982c:68ff:fee3:5fd7",
            ],
          - [
              - "fe80::5463:8ff:fea2:87a2",
            ],
          - [
              - "fe80::9443:f5ff:fe9f:1eaf",
            ],
          - [
              - "fe80::f0d6:f4ff:fe12:f6f5",
            ],
          - [
              - "fe80::bceb:faff:fe04:1c48",
            ],
          - [
              - "fe80::9858:86ff:fe47:20cb",
            ],
          - [
              - "fe80::4098:f4ff:feb9:60e1",
            ],
          - [
              - "fe80::f82a:d5ff:fe31:a48",
            ],
          - [
              - "fe80::149c:e1ff:fe47:c5b1",
            ],
          - [
              - "fe80::e021:a8ff:fe30:b2ca",
            ],
          - [
              - "fe80::387f:79ff:fe3b:203",
            ],
          - [
              - "fe80::ac54:1ff:fe81:ac7d",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "6A:E3:C5:D0:6E:5E",
          - "5A:E1:00:65:27:5B",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:9C:2B:FE",
          - "9A:2C:68:E3:5F:D7",
          - "56:63:08:A2:87:A2",
          - "96:43:F5:9F:1E:AF",
          - "F2:D6:F4:12:F6:F5",
          - "BE:EB:FA:04:1C:48",
          - "9A:58:86:47:20:CB",
          - "42:98:F4:B9:60:E1",
          - "FA:2A:D5:31:0A:48",
          - "16:9C:E1:47:C5:B1",
          - "E2:21:A8:30:B2:CA",
          - "3A:7F:79:3B:02:03",
          - "AE:54:01:81:AC:7D",
        ] -> (known after apply)
        name                                 = "talos-cp-01"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc2b59a7e2804c",
          - "lxc_health",
          - "lxc81d111c3ef70",
          - "lxc0857903ef139",
          - "lxcce5263ed994b",
          - "lxc3d5327db2c66",
          - "lxca131c7c6e46f",
          - "lxcfc77c560c53c",
          - "lxc64398a81740c",
        ] -> (known after apply)
        tags                                 = [
            "terraform",
        ]
      ~ vm_id                                = 101 -> (known after apply)
        # (28 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 100 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-v1.11.5-nocloud-amd64.img" -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-101-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + file_format          = (known after apply)
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:9C:2B:FE" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_workers" {
      ~ boot_order                           = [
          - "virtio0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "102" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "192.168.1.211",
            ],
          - [],
          - [
              - "10.244.0.187",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fd8e:5b31:ecd1:a60b:be24:11ff:fe4f:af80",
              - "fe80::be24:11ff:fe4f:af80",
            ],
          - [
              - "fe80::b4e9:6fff:fef0:8866",
            ],
          - [
              - "fe80::7461:efff:fef0:ed5b",
            ],
          - [
              - "fe80::fc96:89ff:fe29:698d",
            ],
          - [
              - "fe80::54cd:b8ff:fe29:6988",
            ],
          - [
              - "fe80::3062:abff:fe05:6679",
            ],
          - [
              - "fe80::789a:18ff:fe17:8c78",
            ],
          - [
              - "fe80::4005:5ff:fe6b:b262",
            ],
          - [
              - "fe80::f4f9:43ff:fe55:ba0d",
            ],
          - [
              - "fe80::b83a:b6ff:fe12:a752",
            ],
          - [
              - "fe80::6c02:8dff:fe3e:bf7e",
            ],
          - [
              - "fe80::6813:1fff:fef0:120",
            ],
          - [
              - "fe80::88f0:3fff:fedf:ae50",
            ],
          - [
              - "fe80::94fa:cbff:feba:9936",
            ],
          - [
              - "fe80::180a:bcff:feb3:113f",
            ],
          - [
              - "fe80::2c6e:e8ff:fe07:92c1",
            ],
          - [
              - "fe80::78e5:b7ff:fe23:ecb8",
            ],
          - [
              - "fe80::6011:a3ff:fe06:558",
            ],
          - [
              - "fe80::cc4:3ff:fe8c:1ebe",
            ],
          - [
              - "fe80::707c:2fff:feb3:b417",
            ],
          - [
              - "fe80::fca8:ebff:fe16:f8",
            ],
          - [
              - "fe80::98e6:65ff:fef2:12a6",
            ],
          - [
              - "fe80::dc6d:15ff:fe57:8ad2",
            ],
          - [
              - "fe80::c04f:58ff:fe40:fe4e",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "9A:C8:A3:95:A7:D2",
          - "82:2D:22:B7:84:A3",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:4F:AF:80",
          - "B6:E9:6F:F0:88:66",
          - "76:61:EF:F0:ED:5B",
          - "FE:96:89:29:69:8D",
          - "56:CD:B8:29:69:88",
          - "32:62:AB:05:66:79",
          - "7A:9A:18:17:8C:78",
          - "42:05:05:6B:B2:62",
          - "F6:F9:43:55:BA:0D",
          - "BA:3A:B6:12:A7:52",
          - "6E:02:8D:3E:BF:7E",
          - "6A:13:1F:F0:01:20",
          - "8A:F0:3F:DF:AE:50",
          - "96:FA:CB:BA:99:36",
          - "1A:0A:BC:B3:11:3F",
          - "2E:6E:E8:07:92:C1",
          - "7A:E5:B7:23:EC:B8",
          - "62:11:A3:06:05:58",
          - "0E:C4:03:8C:1E:BE",
          - "72:7C:2F:B3:B4:17",
          - "FE:A8:EB:16:00:F8",
          - "9A:E6:65:F2:12:A6",
          - "DE:6D:15:57:8A:D2",
          - "C2:4F:58:40:FE:4E",
        ] -> (known after apply)
        name                                 = "talos-worker-01"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc4c3610359f1e",
          - "lxc89440711391f",
          - "lxc1c512602f594",
          - "lxcf5470bc898a0",
          - "lxcdff94f0ff71b",
          - "lxc913743c8816b",
          - "lxcf6ef1e049105",
          - "lxc4d9a8508aa0d",
          - "lxc8f860ac5c859",
          - "lxc307ecdfdf140",
          - "lxc6f9e95a792b0",
          - "lxc73ddf43ab095",
          - "lxca984ff327c96",
          - "lxc71031af599c3",
          - "lxcd92b08273928",
          - "lxc28e2afddda9a",
          - "lxcf05069ae088e",
          - "lxc3adac225e9d1",
          - "lxcf5a5794a2e4b",
        ] -> (known after apply)
        tags                                 = [
            "terraform",
        ]
      ~ vm_id                                = 102 -> (known after apply)
        # (28 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 100 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-v1.11.5-nocloud-amd64.img" -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-102-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + file_format          = (known after apply)
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:4F:AF:80" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

  # module.talos.data.talos_cluster_health.health will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "talos_cluster_health" "health" {
      + client_configuration = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQakNCOGFBREFnRUNBaEJKRXY5aWVSbWtTVWlwejU1aUpJOXBNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB6TlRFeE1qZ3lNRFV3TWpSYU1CQXhEakFNQmdOVgpCQW9UQlhSaGJHOXpNQ293QlFZREsyVndBeUVBbDk1YnFvTlBQTnJIYlpWOXVqVmN6REVZelBaNG5BQU1tT1JFCmVvUGF5RTZqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjREFRWUkKS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVbUFhLzN0bm8rejBRQVRDKwo5NGRKUCt0cXRNZ3dCUVlESzJWd0EwRUFLeEltQTlHY05uQnJaaEUvTVhrVjAzTWJ1Zkx4ZFJrZkpUbVF0RkVyCkFhcEhPVDZ2MjV1TzllQzBjQWk0VWZvbHVyOCtnUHdWOTN4QnFPK0RvL1JQQWc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJoeHBlMkxHc0Uwc1FBVjhKZ0c3UktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB5TmpFeE16QXlNRFV3TWpSYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTk2c0tlb0dqbVRqck42eUh3SStSSjBUK3JOV1R2TnFpCkJKa2VjNWlKNzZLalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1lCci9lMmVqN1BSQUJNTDczaDBrLzYycTB5REFGQmdNclpYQURRUUJacVNGRwpsOUt1M1g0bzVOeEdRRFNvL0EvWWsrS0lKKzkra2VjSitna3UrTzNvLzdPbk4xM2l5cWdEM0JLN081dDhGWHJICmVEMjZpQ3VZbnY3bE5pWUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + control_plane_nodes  = [
          + "192.168.1.210",
        ]
      + endpoints            = [
          + "192.168.1.210",
        ]
      + id                   = (known after apply)
      + timeouts             = {
          + read = "10m"
        }
      + worker_nodes         = [
          + "192.168.1.211",
        ]
    }

  # module.talos.talos_machine_configuration_apply.cp_config_apply[0] will be destroyed
  # (because resource does not use count)
  - resource "talos_machine_configuration_apply" "cp_config_apply" {
      - apply_mode                  = "auto" -> null
      - client_configuration        = {
          - ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQakNCOGFBREFnRUNBaEJKRXY5aWVSbWtTVWlwejU1aUpJOXBNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB6TlRFeE1qZ3lNRFV3TWpSYU1CQXhEakFNQmdOVgpCQW9UQlhSaGJHOXpNQ293QlFZREsyVndBeUVBbDk1YnFvTlBQTnJIYlpWOXVqVmN6REVZelBaNG5BQU1tT1JFCmVvUGF5RTZqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjREFRWUkKS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVbUFhLzN0bm8rejBRQVRDKwo5NGRKUCt0cXRNZ3dCUVlESzJWd0EwRUFLeEltQTlHY05uQnJaaEUvTVhrVjAzTWJ1Zkx4ZFJrZkpUbVF0RkVyCkFhcEhPVDZ2MjV1TzllQzBjQWk0VWZvbHVyOCtnUHdWOTN4QnFPK0RvL1JQQWc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> null
          - client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJoeHBlMkxHc0Uwc1FBVjhKZ0c3UktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB5TmpFeE16QXlNRFV3TWpSYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTk2c0tlb0dqbVRqck42eUh3SStSSjBUK3JOV1R2TnFpCkJKa2VjNWlKNzZLalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1lCci9lMmVqN1BSQUJNTDczaDBrLzYycTB5REFGQmdNclpYQURRUUJacVNGRwpsOUt1M1g0bzVOeEdRRFNvL0EvWWsrS0lKKzkra2VjSitna3UrTzNvLzdPbk4xM2l5cWdEM0JLN081dDhGWHJICmVEMjZpQ3VZbnY3bE5pWUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
          - client_key         = (sensitive value) -> null
        } -> null
      - config_patches              = [
          - <<-EOT
                machine:
                  network:
                    hostname: talos-cp-01
                    nameservers:
                      - 1.1.1.1
                      - 8.8.8.8
                  features:
                    hostDNS:
                      enabled: false
                  kubelet:
                      extraArgs:
                        rotate-server-certificates: true
                  nodeLabels:
                    topology.kubernetes.io/region: cluster01
                    topology.kubernetes.io/zone: pve01
                
                cluster:
                  allowSchedulingOnControlPlanes: true
                  network:
                    cni:
                      name: none
                  proxy:
                    disabled: true
                  extraManifests:
                    - https://raw.githubusercontent.com/alex1989hu/kubelet-serving-cert-approver/main/deploy/standalone-install.yaml
                    - https://github.com/kubernetes-sigs/metrics-server/releases/latest/download/components.yaml
                  inlineManifests:
                  - name: cilium-values
                    contents: |
                      ---
                      apiVersion: v1
                      kind: ConfigMap
                      metadata:
                        name: cilium-values
                        namespace: kube-system
                      data:
                        values.yaml: |-
                          cluster:
                            name: cluster01
                            id: 1
                          
                          kubeProxyReplacement: true
                          
                          # Talos specific
                          k8sServiceHost: localhost
                          k8sServicePort: 7445
                          securityContext:
                            capabilities:
                              ciliumAgent: [ CHOWN, KILL, NET_ADMIN, NET_RAW, IPC_LOCK, SYS_ADMIN, SYS_RESOURCE, DAC_OVERRIDE, FOWNER, SETGID, SETUID ]
                              cleanCiliumState: [ NET_ADMIN, SYS_ADMIN, SYS_RESOURCE ]
                          
                          cgroup:
                            autoMount:
                              enabled: false
                            hostRoot: /sys/fs/cgroup
                          
                          # https://docs.cilium.io/en/stable/network/concepts/ipam/
                          ipam:
                            mode: kubernetes
                          
                          operator:
                            rollOutPods: true
                            resources:
                              limits:
                                cpu: 500m
                                memory: 256Mi
                              requests:
                                cpu: 50m
                                memory: 128Mi
                          
                          # Roll out cilium agent pods automatically when ConfigMap is updated.
                          rollOutCiliumPods: true
                          resources:
                            limits:
                              cpu: 1000m
                              memory: 1Gi
                            requests:
                              cpu: 200m
                              memory: 512Mi
                          
                          #debug:
                          #  enabled: true
                          
                          # Increase rate limit when doing L2 announcements
                          k8sClientRateLimit:
                            qps: 20
                            burst: 100
                          
                          l2announcements:
                            enabled: true
                          
                          externalIPs:
                            enabled: true
                          
                          ciliumEndpointSlice:
                            enabled: true
                          
                          loadBalancer:
                            # https://docs.cilium.io/en/stable/network/kubernetes/kubeproxy-free/#maglev-consistent-hashing
                            algorithm: maglev
                          
                          gatewayAPI:
                            enabled: true
                          envoy:
                            securityContext:
                              capabilities:
                                keepCapNetBindService: true
                                envoy: [ NET_ADMIN, PERFMON, BPF ]
                          
                          hubble:
                            enabled: true
                            relay:
                              enabled: true
                              rollOutPods: true
                            ui:
                              enabled: true
                              rollOutPods: true
                          
                          ingressController:
                            enabled: false
                            default: true
                            loadbalancerMode: shared
                            service:
                              annotations:
                                io.cilium/lb-ipam-ips: 192.168.1.223
                          
                          # mTLS
                          authentication:
                            enabled: false
                            mutual:
                              spire:
                                enabled: false
                                install:
                                  server:
                                    dataStorage:
                                      storageClass: cilium-spire-sc
                          
                  - name: cilium-bootstrap
                    contents: |
                      ---
                      apiVersion: rbac.authorization.k8s.io/v1
                      kind: ClusterRoleBinding
                      metadata:
                        name: cilium-install
                      roleRef:
                        apiGroup: rbac.authorization.k8s.io
                        kind: ClusterRole
                        name: cluster-admin
                      subjects:
                        - kind: ServiceAccount
                          name: cilium-install
                          namespace: kube-system
                      ---
                      apiVersion: v1
                      kind: ServiceAccount
                      metadata:
                        name: cilium-install
                        namespace: kube-system
                      ---
                      apiVersion: batch/v1
                      kind: Job
                      metadata:
                        name: cilium-install
                        namespace: kube-system
                      spec:
                        backoffLimit: 10
                        template:
                          metadata:
                            labels:
                              app: cilium-install
                          spec:
                            restartPolicy: OnFailure
                            tolerations:
                              - operator: Exists
                              - effect: NoSchedule
                                operator: Exists
                              - effect: NoExecute
                                operator: Exists
                              - effect: PreferNoSchedule
                                operator: Exists
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: NoSchedule
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: NoExecute
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: PreferNoSchedule
                            affinity:
                              nodeAffinity:
                                requiredDuringSchedulingIgnoredDuringExecution:
                                  nodeSelectorTerms:
                                    - matchExpressions:
                                        - key: node-role.kubernetes.io/control-plane
                                          operator: Exists
                            serviceAccountName: cilium-install
                            hostNetwork: true
                            containers:
                              - name: cilium-install
                                image: quay.io/cilium/cilium-cli-ci:latest
                                env:
                                  - name: KUBERNETES_SERVICE_HOST
                                    valueFrom:
                                      fieldRef:
                                        apiVersion: v1
                                        fieldPath: status.podIP
                                  - name: KUBERNETES_SERVICE_PORT
                                    value: "6443"
                                volumeMounts:
                                  - name: values
                                    mountPath: /root/app/values.yaml
                                    subPath: values.yaml
                                command:
                                  - cilium
                                  - install
                                  - --version=v1.16.3 # renovate: github-releases=cilium/cilium
                                  - --set
                                  - kubeProxyReplacement=true
                                  - --values
                                  - values.yaml
                            volumes:
                              - name: values
                                configMap:
                                  name: cilium-values
            EOT,
        ] -> null
      - endpoint                    = "192.168.1.210" -> null
      - id                          = "machine_configuration_apply" -> null
      - machine_configuration       = (sensitive value) -> null
      - machine_configuration_input = (sensitive value) -> null
      - node                        = "192.168.1.210" -> null
    }

  # module.talos.talos_machine_configuration_apply.cp_config_apply["talos-cp-01"] will be created
  + resource "talos_machine_configuration_apply" "cp_config_apply" {
      + apply_mode                  = "auto"
      + client_configuration        = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQakNCOGFBREFnRUNBaEJKRXY5aWVSbWtTVWlwejU1aUpJOXBNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB6TlRFeE1qZ3lNRFV3TWpSYU1CQXhEakFNQmdOVgpCQW9UQlhSaGJHOXpNQ293QlFZREsyVndBeUVBbDk1YnFvTlBQTnJIYlpWOXVqVmN6REVZelBaNG5BQU1tT1JFCmVvUGF5RTZqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjREFRWUkKS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVbUFhLzN0bm8rejBRQVRDKwo5NGRKUCt0cXRNZ3dCUVlESzJWd0EwRUFLeEltQTlHY05uQnJaaEUvTVhrVjAzTWJ1Zkx4ZFJrZkpUbVF0RkVyCkFhcEhPVDZ2MjV1TzllQzBjQWk0VWZvbHVyOCtnUHdWOTN4QnFPK0RvL1JQQWc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJoeHBlMkxHc0Uwc1FBVjhKZ0c3UktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB5TmpFeE16QXlNRFV3TWpSYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTk2c0tlb0dqbVRqck42eUh3SStSSjBUK3JOV1R2TnFpCkJKa2VjNWlKNzZLalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1lCci9lMmVqN1BSQUJNTDczaDBrLzYycTB5REFGQmdNclpYQURRUUJacVNGRwpsOUt1M1g0bzVOeEdRRFNvL0EvWWsrS0lKKzkra2VjSitna3UrTzNvLzdPbk4xM2l5cWdEM0JLN081dDhGWHJICmVEMjZpQ3VZbnY3bE5pWUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + config_patches              = [
          + <<-EOT
                machine:
                  network:
                    hostname: talos-cp-01
                    nameservers:
                      - 1.1.1.1
                      - 8.8.8.8
                  features:
                    hostDNS:
                      enabled: false
                  kubelet:
                      extraArgs:
                        rotate-server-certificates: true
                  nodeLabels:
                    topology.kubernetes.io/region: cluster01
                    topology.kubernetes.io/zone: pve01
                
                cluster:
                  allowSchedulingOnControlPlanes: true
                  network:
                    cni:
                      name: none
                  proxy:
                    disabled: true
                  extraManifests:
                    - https://raw.githubusercontent.com/alex1989hu/kubelet-serving-cert-approver/main/deploy/standalone-install.yaml
                    - https://github.com/kubernetes-sigs/metrics-server/releases/latest/download/components.yaml
                  inlineManifests:
                  - name: cilium-values
                    contents: |
                      ---
                      apiVersion: v1
                      kind: ConfigMap
                      metadata:
                        name: cilium-values
                        namespace: kube-system
                      data:
                        values.yaml: |-
                          cluster:
                            name: cluster01
                            id: 1
                          
                          kubeProxyReplacement: true
                          
                          # Talos specific
                          k8sServiceHost: localhost
                          k8sServicePort: 7445
                          securityContext:
                            capabilities:
                              ciliumAgent: [ CHOWN, KILL, NET_ADMIN, NET_RAW, IPC_LOCK, SYS_ADMIN, SYS_RESOURCE, DAC_OVERRIDE, FOWNER, SETGID, SETUID ]
                              cleanCiliumState: [ NET_ADMIN, SYS_ADMIN, SYS_RESOURCE ]
                          
                          cgroup:
                            autoMount:
                              enabled: false
                            hostRoot: /sys/fs/cgroup
                          
                          # https://docs.cilium.io/en/stable/network/concepts/ipam/
                          ipam:
                            mode: kubernetes
                          
                          operator:
                            rollOutPods: true
                            resources:
                              limits:
                                cpu: 500m
                                memory: 256Mi
                              requests:
                                cpu: 50m
                                memory: 128Mi
                          
                          # Roll out cilium agent pods automatically when ConfigMap is updated.
                          rollOutCiliumPods: true
                          resources:
                            limits:
                              cpu: 1000m
                              memory: 1Gi
                            requests:
                              cpu: 200m
                              memory: 512Mi
                          
                          #debug:
                          #  enabled: true
                          
                          # Increase rate limit when doing L2 announcements
                          k8sClientRateLimit:
                            qps: 20
                            burst: 100
                          
                          l2announcements:
                            enabled: true
                          
                          externalIPs:
                            enabled: true
                          
                          ciliumEndpointSlice:
                            enabled: true
                          
                          loadBalancer:
                            # https://docs.cilium.io/en/stable/network/kubernetes/kubeproxy-free/#maglev-consistent-hashing
                            algorithm: maglev
                          
                          gatewayAPI:
                            enabled: true
                          envoy:
                            securityContext:
                              capabilities:
                                keepCapNetBindService: true
                                envoy: [ NET_ADMIN, PERFMON, BPF ]
                          
                          hubble:
                            enabled: true
                            relay:
                              enabled: true
                              rollOutPods: true
                            ui:
                              enabled: true
                              rollOutPods: true
                          
                          ingressController:
                            enabled: false
                            default: true
                            loadbalancerMode: shared
                            service:
                              annotations:
                                io.cilium/lb-ipam-ips: 192.168.1.223
                          
                          # mTLS
                          authentication:
                            enabled: false
                            mutual:
                              spire:
                                enabled: false
                                install:
                                  server:
                                    dataStorage:
                                      storageClass: cilium-spire-sc
                          
                  - name: cilium-bootstrap
                    contents: |
                      ---
                      apiVersion: rbac.authorization.k8s.io/v1
                      kind: ClusterRoleBinding
                      metadata:
                        name: cilium-install
                      roleRef:
                        apiGroup: rbac.authorization.k8s.io
                        kind: ClusterRole
                        name: cluster-admin
                      subjects:
                        - kind: ServiceAccount
                          name: cilium-install
                          namespace: kube-system
                      ---
                      apiVersion: v1
                      kind: ServiceAccount
                      metadata:
                        name: cilium-install
                        namespace: kube-system
                      ---
                      apiVersion: batch/v1
                      kind: Job
                      metadata:
                        name: cilium-install
                        namespace: kube-system
                      spec:
                        backoffLimit: 10
                        template:
                          metadata:
                            labels:
                              app: cilium-install
                          spec:
                            restartPolicy: OnFailure
                            tolerations:
                              - operator: Exists
                              - effect: NoSchedule
                                operator: Exists
                              - effect: NoExecute
                                operator: Exists
                              - effect: PreferNoSchedule
                                operator: Exists
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: NoSchedule
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: NoExecute
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: PreferNoSchedule
                            affinity:
                              nodeAffinity:
                                requiredDuringSchedulingIgnoredDuringExecution:
                                  nodeSelectorTerms:
                                    - matchExpressions:
                                        - key: node-role.kubernetes.io/control-plane
                                          operator: Exists
                            serviceAccountName: cilium-install
                            hostNetwork: true
                            containers:
                              - name: cilium-install
                                image: quay.io/cilium/cilium-cli-ci:latest
                                env:
                                  - name: KUBERNETES_SERVICE_HOST
                                    valueFrom:
                                      fieldRef:
                                        apiVersion: v1
                                        fieldPath: status.podIP
                                  - name: KUBERNETES_SERVICE_PORT
                                    value: "6443"
                                volumeMounts:
                                  - name: values
                                    mountPath: /root/app/values.yaml
                                    subPath: values.yaml
                                command:
                                  - cilium
                                  - install
                                  - --version=v1.16.3 # renovate: github-releases=cilium/cilium
                                  - --set
                                  - kubeProxyReplacement=true
                                  - --values
                                  - values.yaml
                            volumes:
                              - name: values
                                configMap:
                                  name: cilium-values
            EOT,
        ]
      + endpoint                    = "192.168.1.210"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "192.168.1.210"
    }

  # module.talos.talos_machine_configuration_apply.worker_config_apply[0] will be destroyed
  # (because resource does not use count)
  - resource "talos_machine_configuration_apply" "worker_config_apply" {
      - apply_mode                  = "auto" -> null
      - client_configuration        = {
          - ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQakNCOGFBREFnRUNBaEJKRXY5aWVSbWtTVWlwejU1aUpJOXBNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB6TlRFeE1qZ3lNRFV3TWpSYU1CQXhEakFNQmdOVgpCQW9UQlhSaGJHOXpNQ293QlFZREsyVndBeUVBbDk1YnFvTlBQTnJIYlpWOXVqVmN6REVZelBaNG5BQU1tT1JFCmVvUGF5RTZqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjREFRWUkKS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVbUFhLzN0bm8rejBRQVRDKwo5NGRKUCt0cXRNZ3dCUVlESzJWd0EwRUFLeEltQTlHY05uQnJaaEUvTVhrVjAzTWJ1Zkx4ZFJrZkpUbVF0RkVyCkFhcEhPVDZ2MjV1TzllQzBjQWk0VWZvbHVyOCtnUHdWOTN4QnFPK0RvL1JQQWc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> null
          - client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJoeHBlMkxHc0Uwc1FBVjhKZ0c3UktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB5TmpFeE16QXlNRFV3TWpSYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTk2c0tlb0dqbVRqck42eUh3SStSSjBUK3JOV1R2TnFpCkJKa2VjNWlKNzZLalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1lCci9lMmVqN1BSQUJNTDczaDBrLzYycTB5REFGQmdNclpYQURRUUJacVNGRwpsOUt1M1g0bzVOeEdRRFNvL0EvWWsrS0lKKzkra2VjSitna3UrTzNvLzdPbk4xM2l5cWdEM0JLN081dDhGWHJICmVEMjZpQ3VZbnY3bE5pWUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
          - client_key         = (sensitive value) -> null
        } -> null
      - config_patches              = [
          - <<-EOT
                machine:
                  network:
                    hostname: talos-worker-01
                    nameservers:
                      - 1.1.1.1
                      - 8.8.8.8
                  kubelet:
                    extraArgs:
                      rotate-server-certificates: true
                  nodeLabels:
                    topology.kubernetes.io/region: cluster01
                    topology.kubernetes.io/zone: pve01
            EOT,
        ] -> null
      - endpoint                    = "192.168.1.211" -> null
      - id                          = "machine_configuration_apply" -> null
      - machine_configuration       = (sensitive value) -> null
      - machine_configuration_input = (sensitive value) -> null
      - node                        = "192.168.1.211" -> null
    }

  # module.talos.talos_machine_configuration_apply.worker_config_apply["talos-worker-01"] will be created
  + resource "talos_machine_configuration_apply" "worker_config_apply" {
      + apply_mode                  = "auto"
      + client_configuration        = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQakNCOGFBREFnRUNBaEJKRXY5aWVSbWtTVWlwejU1aUpJOXBNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB6TlRFeE1qZ3lNRFV3TWpSYU1CQXhEakFNQmdOVgpCQW9UQlhSaGJHOXpNQ293QlFZREsyVndBeUVBbDk1YnFvTlBQTnJIYlpWOXVqVmN6REVZelBaNG5BQU1tT1JFCmVvUGF5RTZqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjREFRWUkKS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVbUFhLzN0bm8rejBRQVRDKwo5NGRKUCt0cXRNZ3dCUVlESzJWd0EwRUFLeEltQTlHY05uQnJaaEUvTVhrVjAzTWJ1Zkx4ZFJrZkpUbVF0RkVyCkFhcEhPVDZ2MjV1TzllQzBjQWk0VWZvbHVyOCtnUHdWOTN4QnFPK0RvL1JQQWc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJoeHBlMkxHc0Uwc1FBVjhKZ0c3UktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB5TmpFeE16QXlNRFV3TWpSYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTk2c0tlb0dqbVRqck42eUh3SStSSjBUK3JOV1R2TnFpCkJKa2VjNWlKNzZLalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1lCci9lMmVqN1BSQUJNTDczaDBrLzYycTB5REFGQmdNclpYQURRUUJacVNGRwpsOUt1M1g0bzVOeEdRRFNvL0EvWWsrS0lKKzkra2VjSitna3UrTzNvLzdPbk4xM2l5cWdEM0JLN081dDhGWHJICmVEMjZpQ3VZbnY3bE5pWUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + config_patches              = [
          + <<-EOT
                machine:
                  network:
                    hostname: talos-worker-01
                    nameservers:
                      - 1.1.1.1
                      - 8.8.8.8
                  kubelet:
                    extraArgs:
                      rotate-server-certificates: true
                  nodeLabels:
                    topology.kubernetes.io/region: cluster01
                    topology.kubernetes.io/zone: pve01
            EOT,
        ]
      + endpoint                    = "192.168.1.211"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "192.168.1.211"
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Warning: Deprecated Resource

  with module.monitoring.kubernetes_namespace.monitoring,
  on modules/monitoring/main.tf line 2, in resource "kubernetes_namespace" "monitoring":
   2: resource "kubernetes_namespace" "monitoring" {

Deprecated; use kubernetes_namespace_v1.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Triggered by @ravilushqa*